# 성실한 개미 (리스트)
# 왕개미를 연구중이다. 그 개미는 개미굴에서 나와 먹이까지 가장 빠른 길로 이동한다.
# 개미는 오른쪽으로 움직이다가 벽을 만나면 아래쪽으로 움직여 가장 빠른 길로 움직였다.
# (오른쪽에 길이 나타나면 다시 오른쪽으로 움직인다.)
# 미로 상자에 넣은 개미는 먹이를 찾았거나, 더 이상 움직일 수 없을 때까지 오른쪽 또는 아래쪽으로만 움직였다.
# 미로 상자의 구조가 0(갈 수 있는 곳), 1(벽 또는 장애물)로 주어지고, 먹이가 2로 주어질 때, 성실한 개미의 이동 경로를 예상해보자.

# * 제한사항 *
#  맨 아래의 가장 오른쪽에 도착한 경우, 더 이상 움직일 수 없는 경우,
# 먹이를 찾은 경우에는 더이상 이동하지 않고 그 곳에 머무른다고 가정
# 미로 상자의 테두리는 모두 벽으로 되어 있으며, 개미집은 반드시 (2, 2)에 존재하기 때문에 개미는 (2, 2)에서 출발

# 입력 예시
1 1 1 1 1 1 1 1 1 1
1 0 0 1 0 0 0 0 0 1
1 0 0 1 1 1 0 0 0 1
1 0 0 0 0 0 0 1 0 1
1 0 0 0 0 0 0 1 0 1
1 0 0 0 0 1 0 1 0 1
1 0 0 0 0 1 2 1 0 1
1 0 0 0 0 1 0 0 0 1
1 0 0 0 0 0 0 0 0 1
1 1 1 1 1 1 1 1 1 1

# 출력 예시
1 1 1 1 1 1 1 1 1 1
1 9 9 1 0 0 0 0 0 1
1 0 9 1 1 1 0 0 0 1
1 0 9 9 9 9 9 1 0 1
1 0 0 0 0 0 9 1 0 1
1 0 0 0 0 1 9 1 0 1
1 0 0 0 0 1 9 1 0 1
1 0 0 0 0 1 0 0 0 1
1 0 0 0 0 0 0 0 0 1
1 1 1 1 1 1 1 1 1 1


# 내 답안
n = [input().split() for _ in range(10)]
stop, l2 = 0, 1
for i in range(1,len(n)):
    if stop == 1 : break
    for j in range(l2,len(n)):
        if n[i][j] == '0': n[i][j] = '9'
        if n[i][j] == '1' :
            l2 = j-1
            break
        if n[i][j] == '2' :
            n[i][j] = '9'
            stop = 1
            break
for x in range(len(n)):
    for y in range(len(n)):
        print(n[x][y],end=" ")
    print()
